---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.GetEnumerator
source: html/300f65ea-69ed-5d29-7120-7c0028a366dc.htm
---
# Autodesk.Revit.DB.PhaseArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.